Revit 2027 API
TableSectionData.IsValidImageSymbolId Method
 Identifies if the element id represents a valid ImageSymbol element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidImageSymbolId(
	ElementId imageSymbolId
)
Public Function IsValidImageSymbolId (
	imageSymbolId As ElementId
) As Boolean
public:
bool IsValidImageSymbolId(
	ElementId^ imageSymbolId
)
member IsValidImageSymbolId :
        imageSymbolId : ElementId -> bool
Parameters
imageSymbolId ElementId
 The element id of the image symbol.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace